## Plan Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/10068092854)



<pre><code>Plan: 27 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * google_service_account.control-plane
  * google_service_account.counduit-cli-bucket
  * google_service_account.firebase-adminsdk-udzxq
  * google_service_account.gcr-cleaner
  * google_service_account.gencred-refresher
  * google_service_account.gitleaks-secret-accesor
  * google_service_account.kyma-oci-image-builder
  * google_service_account.sa-dev-kyma-project
  * google_service_account.sa-gardener-logs
  * google_service_account.sa-gcr-kyma-project-trusted
  * google_service_account.sa-gcs-plank
  * google_service_account.sa-gke-kyma-integration
  * google_service_account.sa-kyma-artifacts
  * google_service_account.sa-kyma-dns-serviceuser
  * google_service_account.sa-kyma-project
  * google_service_account.sa-prow-deploy
  * google_service_account.sa-prow-job-resource-cleaners
  * google_service_account.sa-prow-pubsub
  * google_service_account.sa-prowjob-gcp-logging-client
  * google_service_account.sa-secret-update
  * google_service_account.sa-security-dashboard-oauth
  * google_service_account.sa-vm-kyma-integration
  * google_service_account.secret-manager-prow
  * google_service_account.secret-manager-trusted
  * google_service_account.secret-manager-untrusted
  * google_service_account.terraform-executor
  * google_service_account.terraform-planner
* Update
  * module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner



<details><summary>Change Result (Click me)</summary>

```hcl

  # google_service_account.control-plane will be created
  + resource "google_service_account" "control-plane" {
      + account_id   = "control-plane"
      + description  = "Main prow components SA Will be removed with Prow"
      + disabled     = false
      + display_name = "control-plane"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.counduit-cli-bucket will be created
  + resource "google_service_account" "counduit-cli-bucket" {
      + account_id   = "counduit-cli-bucket"
      + description  = "SA to push/pull conduit-cli"
      + disabled     = false
      + display_name = "counduit-cli-bucket"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.firebase-adminsdk-udzxq will be created
  + resource "google_service_account" "firebase-adminsdk-udzxq" {
      + account_id   = "firebase-adminsdk-udzxq"
      + description  = "Firebase Admin SDK Service Agent"
      + disabled     = false
      + display_name = "firebase-adminsdk"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.gcr-cleaner will be created
  + resource "google_service_account" "gcr-cleaner" {
      + account_id   = "gcr-cleaner"
      + description  = "Service account is used by gcr-cleaner tool."
      + disabled     = false
      + display_name = "gcr-cleaner"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.gencred-refresher will be created
  + resource "google_service_account" "gencred-refresher" {
      + account_id   = "gencred-refresher"
      + description  = "Service Account used to automatically refresh kubeconfigs for workload cluster on Prow using ProwJob `ci-gencred-refresh-kubeconfig` Will be removed with Prow"
      + disabled     = false
      + display_name = "gencred-refresher"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.gitleaks-secret-accesor will be created
  + resource "google_service_account" "gitleaks-secret-accesor" {
      + account_id   = "gitleaks-secret-accesor"
      + description  = "Identity of gitleaks. It's used to retrieve secrets from secret manager"
      + disabled     = false
      + display_name = "gitleaks-secret-accesor"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.kyma-oci-image-builder will be created
  + resource "google_service_account" "kyma-oci-image-builder" {
      + account_id   = "kyma-oci-image-builder"
      + description  = "Service Account for retrieving secrets on the oci-image-builder ADO pipeline."
      + disabled     = false
      + display_name = "kyma-oci-image-builder"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.sa-dev-kyma-project will be created
  + resource "google_service_account" "sa-dev-kyma-project" {
      + account_id   = "sa-dev-kyma-project"
      + description  = "SA to manage DEV Artifact Registry in SAP CX Kyma Project"
      + disabled     = false
      + display_name = "sa-dev-kyma-project"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.sa-gardener-logs will be created
  + resource "google_service_account" "sa-gardener-logs" {
      + account_id   = "sa-gardener-logs"
      + description  = "SA used by gardener cluster to send logs to Stackdriver. Will be removed with Prow"
      + disabled     = false
      + display_name = "sa-gardener-logs"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.sa-gcr-kyma-project-trusted will be created
  + resource "google_service_account" "sa-gcr-kyma-project-trusted" {
      + account_id   = "sa-gcr-kyma-project-trusted"
      + description  = "Access to GCR in kyma-project and KMS key in kyma-prow. Will be removed with Prow"
      + disabled     = false
      + display_name = "sa-gcr-kyma-project-trusted"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.sa-gcs-plank will be created
  + resource "google_service_account" "sa-gcs-plank" {
      + account_id   = "sa-gcs-plank"
      + description  = "The `plank` component schedules the pod requested by a prowjob. Will be removed with Prow"
      + disabled     = false
      + display_name = "sa-gcs-plank"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.sa-gke-kyma-integration will be created
  + resource "google_service_account" "sa-gke-kyma-integration" {
      + account_id   = "sa-gke-kyma-integration"
      + description  = "Service account is used by Prow to integrate with GKE. Will be removed with Prow"
      + disabled     = false
      + display_name = "sa-gke-kyma-integration"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.sa-kyma-artifacts will be created
  + resource "google_service_account" "sa-kyma-artifacts" {
      + account_id   = "sa-kyma-artifacts"
      + description  = "Service account used by ProwJob kyma-artifacts. Will be removed with Prow"
      + disabled     = false
      + display_name = "sa-kyma-artifacts"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.sa-kyma-dns-serviceuser will be created
  + resource "google_service_account" "sa-kyma-dns-serviceuser" {
      + account_id   = "sa-kyma-dns-serviceuser"
      + description  = "<Used by api-gateway> Service Account used to manipulate DNS entries in sap-kyma-prow-workloads. Will be removed with Prow"
      + disabled     = false
      + display_name = "sa-kyma-dns-serviceuser"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.sa-kyma-project will be created
  + resource "google_service_account" "sa-kyma-project" {
      + account_id   = "sa-kyma-project"
      + description  = "SA to manage PROD Artifact Registry in SAP CX Kyma Project"
      + disabled     = false
      + display_name = "sa-kyma-project"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.sa-prow-deploy will be created
  + resource "google_service_account" "sa-prow-deploy" {
      + account_id   = "sa-prow-deploy"
      + description  = "SA with admin rights in Prow cluster Will be removed with Prow"
      + disabled     = false
      + display_name = "sa-prow-deploy"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.sa-prow-job-resource-cleaners will be created
  + resource "google_service_account" "sa-prow-job-resource-cleaners" {
      + account_id   = "sa-prow-job-resource-cleaners"
      + description  = "SA used by multiple resource cleaner prowjobs. Will be removed with Prow"
      + disabled     = false
      + display_name = "sa-prow-job-resource-cleaners"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.sa-prow-pubsub will be created
  + resource "google_service_account" "sa-prow-pubsub" {
      + account_id   = "sa-prow-pubsub"
      + description  = "Run prow related pubsub topics, subscriptions and cloud functions. Will be removed with Prow"
      + disabled     = false
      + display_name = "sa-prow-pubsub"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.sa-prowjob-gcp-logging-client will be created
  + resource "google_service_account" "sa-prowjob-gcp-logging-client" {
      + account_id   = "sa-prowjob-gcp-logging-client"
      + description  = "Read, write access to google cloud logging for prowjobs. Will be removed with Prow"
      + disabled     = false
      + display_name = "sa-prowjob-gcp-logging-client"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.sa-secret-update will be created
  + resource "google_service_account" "sa-secret-update" {
      + account_id   = "sa-secret-update"
      + description  = "Can update secrets in Secret Manager"
      + disabled     = false
      + display_name = "sa-secret-update"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.sa-security-dashboard-oauth will be created
  + resource "google_service_account" "sa-security-dashboard-oauth" {
      + account_id   = "sa-security-dashboard-oauth"
      + description  = "Used for the Security dashboard cloud run"
      + disabled     = false
      + display_name = "sa-security-dashboard-oauth"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.sa-vm-kyma-integration will be created
  + resource "google_service_account" "sa-vm-kyma-integration" {
      + account_id   = "sa-vm-kyma-integration"
      + description  = "Will be removed with Prow"
      + disabled     = false
      + display_name = "sa-vm-kyma-integration"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.secret-manager-prow will be created
  + resource "google_service_account" "secret-manager-prow" {
      + account_id   = "secret-manager-prow"
      + description  = "Will be removed with Prow"
      + disabled     = false
      + display_name = "secret-manager-prow"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.secret-manager-trusted will be created
  + resource "google_service_account" "secret-manager-trusted" {
      + account_id   = "secret-manager-trusted"
      + description  = "Will be removed with Prow"
      + disabled     = false
      + display_name = "secret-manager-trusted"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.secret-manager-untrusted will be created
  + resource "google_service_account" "secret-manager-untrusted" {
      + account_id   = "secret-manager-untrusted"
      + description  = "Will be deleted with Prow"
      + disabled     = false
      + display_name = "secret-manager-untrusted"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.terraform-executor will be created
  + resource "google_service_account" "terraform-executor" {
      + account_id   = "terraform-executor"
      + description  = "Identity of terraform executor. It's mapped to k8s service account through workload identity."
      + disabled     = false
      + display_name = "terraform-executor"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.terraform-planner will be created
  + resource "google_service_account" "terraform-planner" {
      + account_id   = "terraform-planner"
      + description  = "Identity of terraform planner"
      + disabled     = false
      + display_name = "terraform-planner"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner will be updated in-place
  ~ resource "google_cloud_scheduler_job" "service_account_keys_cleaner" {
        id               = "projects/sap-kyma-prow/locations/europe-west3/jobs/service-account-keys-cleaner"
        name             = "service-account-keys-cleaner"
        # (8 unchanged attributes hidden)

      ~ http_target {
          ~ uri         = "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app/?project=sap-kyma-prow&age=24" -> "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app?project=sap-kyma-prow&age=24"
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

Plan: 27 to add, 1 to change, 0 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"pull-plan-prod-terraform","PRNumber":11437,"Program":"tfcmt","SHA1":"5c3d2fce8a3635faef0bf922239bb059a99f8e84","Vars":{},"WorkflowName":"Pull Plan Prod Terraform"} -->